In [61]:
import pandas as pd

In [62]:
df = pd.read_csv("/home/tanveer/Documents/projects/kv_dashboards/marksheets/class_6_a_hy_60.csv")
df["class"] = 6
df["section"] = "a"
df["exam"] = "hy"
df["exam_total"] = 60
df.head()

,roll no,name,sst,hindi,english,maths,science,sanskrit,class,section,exam,exam_total
0,1,ANGELINA BORAH,40,41,56,44,37,45,6,a,hy,60
1,2,BONASHREE DAS,7,13,16,11,6,33,6,a,hy,60
2,3,GARGI BHATTACHARJEE,13,14,31,13,7,24,6,a,hy,60
3,4,JIYA MANDAL,2,12,11,14,13,33,6,a,hy,60
4,5,KASTURI SAIKIA,18,31,39,13,24,38,6,a,hy,60

In [63]:
df.columns

Index(['roll no', 'name', 'sst', 'hindi', 'english', 'maths', 'science',
       'sanskrit', 'class', 'section', 'exam', 'exam_total'],
      dtype='object')

In [64]:
df = df.melt(["roll no", "name",'class', 'section', 'exam', 'exam_total'], var_name="subject", value_name="marks")

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 222 entries, 0 to 221
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   roll no     222 non-null    int64
 1   name        222 non-null    object
 2   class       222 non-null    int64
 3   section     222 non-null    object
 4   exam        222 non-null    object
 5   exam_total  222 non-null    int64
 6   subject     222 non-null    object
 7   marks       222 non-null    object
dtypes: int64(3), object(5)
memory usage: 14.0+ KB

In [66]:
attendence = []
marks_new = []
for i in df["marks"]:
    if i in ["AB", "Ab", "ab", "ABSENT", "ABSENT "]:
        attendence.append("absent")
        marks_new.append(0)
    else:
        attendence.append("present")
        marks_new.append(int(i))

df["attendence"] = attendence
df["marks"] = marks_new

In [67]:
df[df["attendence"] == "absent"]

,roll no,name,class,section,exam,exam_total,subject,marks,attendence
14,15,SANIYA KHATOON,6,a,hy,60,sst,0,absent
51,15,SANIYA KHATOON,6,a,hy,60,hindi,0,absent
88,15,SANIYA KHATOON,6,a,hy,60,english,0,absent
125,15,SANIYA KHATOON,6,a,hy,60,maths,0,absent
142,32,SYED SABIQ HAQUE,6,a,hy,60,maths,0,absent
162,15,SANIYA KHATOON,6,a,hy,60,science,0,absent

In [70]:
df["percentage"] = round((df["marks"]/df["exam_total"]) * 100, 2)
df

,roll no,name,class,section,exam,exam_total,subject,marks,attendence,percentage
0,1,ANGELINA BORAH,6,a,hy,60,sst,40,present,66.67
1,2,BONASHREE DAS,6,a,hy,60,sst,7,present,11.67
2,3,GARGI BHATTACHARJEE,6,a,hy,60,sst,13,present,21.67
3,4,JIYA MANDAL,6,a,hy,60,sst,2,present,3.33
4,5,KASTURI SAIKIA,6,a,hy,60,sst,18,present,30.00
...,...,...,...,...,...,...,...,...,...,...
217,33,TANMOY CHAKRABORTY,6,a,hy,60,sanskrit,38,present,63.33
218,34,TANUSH KUMAR SAH,6,a,hy,60,sanskrit,58,present,96.67
219,35,UTKARSH RAJ,6,a,hy,60,sanskrit,38,present,63.33
220,36,WASHAF HAQUE,6,a,hy,60,sanskrit,20,present,33.33
221,37,AADESH MAHATO,6,a,hy,60,sanskrit,15,present,25.00

In [73]:
category = []
for attendence, percentage in zip(df["attendence"], df["percentage"]):
    if attendence == "absent":
        category.append("absent")
    else:
        if percentage < 33:
            category.append("0_to_33")
        elif 33 <= percentage < 45:
            category.append("33_to_45")
        elif 45 <= percentage < 60:
            category.append("45_to_60")
        elif 60 <= percentage < 75:
            category.append("60_to_75")
        elif 75 <= percentage < 90:
            category.append("75_to_90")
        else:
            category.append("90_to_100")

df["category"] = category

In [74]:
df

,roll no,name,class,section,exam,exam_total,subject,marks,attendence,percentage,category
0,1,ANGELINA BORAH,6,a,hy,60,sst,40,present,66.67,60_to_75
1,2,BONASHREE DAS,6,a,hy,60,sst,7,present,11.67,0_to_33
2,3,GARGI BHATTACHARJEE,6,a,hy,60,sst,13,present,21.67,0_to_33
3,4,JIYA MANDAL,6,a,hy,60,sst,2,present,3.33,0_to_33
4,5,KASTURI SAIKIA,6,a,hy,60,sst,18,present,30.00,0_to_33
...,...,...,...,...,...,...,...,...,...,...,...
217,33,TANMOY CHAKRABORTY,6,a,hy,60,sanskrit,38,present,63.33,60_to_75
218,34,TANUSH KUMAR SAH,6,a,hy,60,sanskrit,58,present,96.67,90_to_100
219,35,UTKARSH RAJ,6,a,hy,60,sanskrit,38,present,63.33,60_to_75
220,36,WASHAF HAQUE,6,a,hy,60,sanskrit,20,present,33.33,33_to_45
221,37,AADESH MAHATO,6,a,hy,60,sanskrit,15,present,25.00,0_to_33